In [1]:
import numpy as np
import pandas as pd

In [4]:
data = np.arange(5,10)
data

array([5, 6, 7, 8, 9])

In [5]:
pd_series = pd.Series(data=data)
pd_series

0    5
1    6
2    7
3    8
4    9
dtype: int64

In [6]:
data = {
    "Name": ["Adnan", "Karim", "Rahim"],
    "Age": [22, 25, 24],
    "City": ["Dhaka", "Chittagong", "Sylhet"]
}

In [10]:
df = pd.DataFrame(data)
df

    Name  Age        City
0  Adnan   22       Dhaka
1  Karim   25  Chittagong
2  Rahim   24      Sylhet

In [11]:
df.head()

    Name  Age        City
0  Adnan   22       Dhaka
1  Karim   25  Chittagong
2  Rahim   24      Sylhet

In [12]:
df.tail(2)

    Name  Age        City
1  Karim   25  Chittagong
2  Rahim   24      Sylhet

In [14]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [15]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [16]:
df.shape

(3, 3)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [19]:
df["Country"] = "Bangladesh"
df

    Name  Age        City     Country
0  Adnan   22       Dhaka  Bangladesh
1  Karim   25  Chittagong  Bangladesh
2  Rahim   24      Sylhet  Bangladesh

In [1]:
import pandas as pd
import numpy as np

In [2]:
data  = np.random.rand(6,5)
data

array([[0.93066384, 0.71989333, 0.03916696, 0.52295154, 0.71975554],
       [0.39976521, 0.99763167, 0.05464498, 0.08964776, 0.40752442],
       [0.17844625, 0.99228851, 0.92805629, 0.77140114, 0.24693436],
       [0.00321321, 0.57521244, 0.5004293 , 0.64870304, 0.06749141],
       [0.27270471, 0.44823123, 0.8853626 , 0.56963906, 0.58190069],
       [0.19689131, 0.35144116, 0.54476611, 0.9096175 , 0.99031578]])

In [3]:
df = pd.DataFrame(data=data)
df

          0         1         2         3         4
0  0.930664  0.719893  0.039167  0.522952  0.719756
1  0.399765  0.997632  0.054645  0.089648  0.407524
2  0.178446  0.992289  0.928056  0.771401  0.246934
3  0.003213  0.575212  0.500429  0.648703  0.067491
4  0.272705  0.448231  0.885363  0.569639  0.581901
5  0.196891  0.351441  0.544766  0.909618  0.990316

In [4]:
df[0]

0    0.930664
1    0.399765
2    0.178446
3    0.003213
4    0.272705
5    0.196891
Name: 0, dtype: float64

In [5]:
type(df[0])

pandas.core.series.Series

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "Name" :["Adnan",  "Rahim", "Karim"],
    "Age" : [20, 30, 50],
    "City" : ["Dhaka", "Rajshahi", "Bogura"]
})
df

    Name  Age      City
0  Adnan   20     Dhaka
1  Rahim   30  Rajshahi
2  Karim   50    Bogura

In [3]:
df.drop("Age", axis=1)

    Name      City
0  Adnan     Dhaka
1  Rahim  Rajshahi
2  Karim    Bogura

In [4]:
df = pd.DataFrame({
    "Name" :["Adnan",  "Rahim", "Karim"],
    "Age" : [20, 30, 50],
    "City" : ["Dhaka", "Rajshahi", "Bogura"]
})
df

    Name  Age      City
0  Adnan   20     Dhaka
1  Rahim   30  Rajshahi
2  Karim   50    Bogura

In [10]:
df2 = df.drop(0, axis=0, inplace=True)

KeyError: '[0] not found in axis'

In [11]:
df = pd.DataFrame({
    "Name": ["A", "B", "C", "D"],
    "Age": [18, 25, 30, 40],
    "City": ["Dhaka", "Khulna", "Rajshahi", "Dhaka"]
})
df

  Name  Age      City
0    A   18     Dhaka
1    B   25    Khulna
2    C   30  Rajshahi
3    D   40     Dhaka

In [12]:
df[df["Age"] > 25]

  Name  Age      City
2    C   30  Rajshahi
3    D   40     Dhaka

In [14]:
df[df["Age"] == 40 ]

  Name  Age   City
3    D   40  Dhaka

In [15]:
df[df["Age"] < 30 ]

  Name  Age    City
0    A   18   Dhaka
1    B   25  Khulna

In [16]:
df[df["City"] == "Dhaka"]

  Name  Age   City
0    A   18  Dhaka
3    D   40  Dhaka

In [17]:
df[(df["Age"] > 20) & (df["City"] == "Dhaka")]

  Name  Age   City
3    D   40  Dhaka

In [18]:
df[df["Age"].isin([18,40])]

  Name  Age   City
0    A   18  Dhaka
3    D   40  Dhaka

In [19]:
df[~df["Age"].isin([18, 40])]

  Name  Age      City
1    B   25    Khulna
2    C   30  Rajshahi

In [22]:
data = {
    "Name": ["Adnan", "Rahim", "Sumi"],
    "Age": [25, 30, 22],
    "City": ["Dhaka", "Chittagong", "Khulna"]
}

df = pd.DataFrame(data)
print(df)

    Name  Age        City
0  Adnan   25       Dhaka
1  Rahim   30  Chittagong
2   Sumi   22      Khulna

In [2]:
import pandas as pd
import numpy as np

In [4]:
data  = np.random.randn(8,5)

df = pd.DataFrame(
    data=data,
    index = ['row1', 'row2', 'row3', 'row4', 'row5','row6', 'row7', 'row8'],
    columns = ['col1',  'col2', 'col3', 'col4', 'col5']

)
df

          col1      col2      col3      col4      col5
row1 -1.062901  0.350288 -0.191752 -0.022151  0.087609
row2 -0.904633 -1.044948 -0.799554  2.487824 -0.590726
row3  0.867521 -0.844422  0.195480  1.952862 -1.989888
row4 -0.443054  3.866672  0.237908 -1.705133  1.421108
row5  0.202803  0.489256  0.005844  0.453028  0.852455
row6  0.436685 -1.358991 -0.096124  0.721475  0.702352
row7  0.106142  0.299451 -0.482422 -1.439992 -0.353999
row8  0.436717  0.329435  0.461705 -0.875975  1.267503

In [1]:
import numpy as np
import pandas as pd

In [2]:
groups = ['group1']*3 + ['group2']*3
groups

['group1', 'group1', 'group1', 'group2', 'group2', 'group2']

In [1]:
import numpy as np
import pandas as pd

In [3]:
left = pd.DataFrame({
    'key1': ['k0', 'k1', 'k2', 'k3'],
    'A' : np.random.randint(1,10, size=4),
    'B' : np.random.randint(1, 10, size=4),
})

right = pd.DataFrame({
    'key1' : ['k0', 'k2', 'k4', 'k5'],
    'C' : np.random.randint(1, 10, size=4),
    'D' : np.random.randint(1, 10, size=4),
})

In [6]:
left

  key1  A  B
0   k0  2  3
1   k1  6  9
2   k2  3  1
3   k3  1  2

In [7]:
right

  key1  C  D
0   k0  3  8
1   k2  7  9
2   k4  3  2
3   k5  9  5

In [9]:
pd.merge(left, right, on='key1', how='inner')

  key1  A  B  C  D
0   k0  2  3  3  8
1   k2  3  1  7  9

In [12]:
pd.merge(left, right, on='key1', how='right')

  key1    A    B  C  D
0   k0  2.0  3.0  3  8
1   k2  3.0  1.0  7  9
2   k4  NaN  NaN  3  2
3   k5  NaN  NaN  9  5

In [13]:
left = pd.DataFrame({'A': np.random.randint(1,10, size=5),
                     'B': np.random.randint(1,10,size=5),
                     }, index=[0,2,3,4,6])


right = pd.DataFrame({'C': np.random.randint(1,10,size=4),
                      'D': np.random.randint(1,10,size=4),
                      }, index=[0,1,2,3])

In [14]:
left

   A  B
0  7  3
2  8  9
3  8  8
4  6  2
6  6  9

In [15]:
right

   C  D
0  1  8
1  1  2
2  6  7
3  9  3

In [17]:
left.join(right, how='inner')

   A  B  C  D
0  7  3  1  8
2  8  9  6  7
3  8  8  9  3

In [20]:
right.join(left)

   C  D    A    B
0  1  8  7.0  3.0
1  1  2  NaN  NaN
2  6  7  8.0  9.0
3  9  3  8.0  8.0

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
    'col1': np.random.randint(1,10,size=10),
    'col2': np.random.randint(100,500, size=10),
    'col3': np.random.choice(['steve', 'bob', 'mike', 'sara'], size=10)

})
df

   col1  col2   col3
0     9   160   mike
1     5   428   sara
2     4   247    bob
3     3   485    bob
4     8   270   sara
5     1   355    bob
6     3   133   sara
7     1   309  steve
8     8   101    bob
9     2   316    bob

In [4]:
df.head(10)

   col1  col2   col3
0     9   160   mike
1     5   428   sara
2     4   247    bob
3     3   485    bob
4     8   270   sara
5     1   355    bob
6     3   133   sara
7     1   309  steve
8     8   101    bob
9     2   316    bob

In [5]:
df["col3"].unique()

array(['mike', 'sara', 'bob', 'steve'], dtype=object)

In [6]:
df['col3'].nunique()

4

In [7]:
df['col3'].value_counts()

col3
bob      5
sara     3
mike     1
steve    1
Name: count, dtype: int64

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    10 non-null     int32
 1   col2    10 non-null     int32
 2   col3    10 non-null     object
dtypes: int32(2), object(1)
memory usage: 292.0+ bytes

In [9]:
df.sort_values(by='col2')

   col1  col2   col3
8     8   101    bob
6     3   133   sara
0     9   160   mike
2     4   247    bob
4     8   270   sara
7     1   309  steve
9     2   316    bob
5     1   355    bob
1     5   428   sara
3     3   485    bob

In [10]:
def times3(x):
    return x*3

In [11]:
df['col2'].apply(times3)

0     480
1    1284
2     741
3    1455
4     810
5    1065
6     399
7     927
8     303
9     948
Name: col2, dtype: int64

In [12]:
df['col3'].apply(len)

0    4
1    4
2    3
3    3
4    4
5    3
6    4
7    5
8    3
9    3
Name: col3, dtype: int64

In [13]:
df.to_csv('test.csv')

In [15]:
pd.read_csv('test.csv', index_col=0)

   col1  col2   col3
0     9   160   mike
1     5   428   sara
2     4   247    bob
3     3   485    bob
4     8   270   sara
5     1   355    bob
6     3   133   sara
7     1   309  steve
8     8   101    bob
9     2   316    bob

In [1]:
import numpy as np
import pandas as pd